template_case/airfoil2d/0.orig/U
/* ARGUS airfoil2d (org-7). Condition CR: U=34.0 m/s. Condition WT: U=40.8. Alpha via inlet vector (Ux=U cos a, Uz=U sin a) set by trim script. */
FoamFile { version 2.0; format ascii; class volVectorField; object U; }
dimensions [0 1 -1 0 0 0 0];
internalField uniform (34.0 0 0);
boundaryField
{
    inlet    { type fixedValue; value $internalField; }
    outlet   { type inletOutlet; inletValue uniform (0 0 0); value $internalField; }
    farfield { type fixedValue; value $internalField; }
    front    { type empty; }
    back     { type empty; }
    airfoil  { type noSlip; }
}
