template_case/airfoil2d/0.orig/nut
FoamFile { version 2.0; format ascii; class volScalarField; object nut; }
dimensions [0 2 -1 0 0 0 0];
internalField uniform 1e-8;
boundaryField
{
    inlet    { type calculated; value $internalField; }
    outlet   { type calculated; value $internalField; }
    farfield { type calculated; value $internalField; }
    front    { type empty; }
    back     { type empty; }
    airfoil  { type nutLowReWallFunction; value uniform 0; }
}
