template_case/airfoil2d/constant/turbulenceProperties
/* org-7 file name and syntax (D009) */
FoamFile { version 2.0; format ascii; class dictionary; object turbulenceProperties; }
simulationType RAS;
RAS { RASModel kOmegaSST; turbulence on; printCoeffs on; }
