template_case/airfoil2d/system/fvSchemes
/* Validation-grade: second order everywhere incl. turbulence (mirrors wing3d, D011) */
FoamFile { version 2.0; format ascii; class dictionary; object fvSchemes; }
ddtSchemes { default steadyState; }
gradSchemes { default cellLimited Gauss linear 1; grad(U) cellLimited Gauss linear 1; }
divSchemes
{
    default none;
    div(phi,U) bounded Gauss linearUpwind grad(U);
    div(phi,k) bounded Gauss linearUpwind default;         // D013: fragile on high-aspect
    div(phi,omega) bounded Gauss linearUpwind default;     // low-Re grids; robust 2nd-order
                                                           // fallback: limitedLinear 1
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}
laplacianSchemes { default Gauss linear corrected; }
interpolationSchemes { default linear; }
snGradSchemes { default corrected; }
wallDist { method meshWave; }
